; domain
(define (domain blocks)
  (:requirements :strips :equality :disjunctive-preconditions :derived-predicates :negative-preconditions :conditional-effects :existential-preconditions :typing)

  (:types
    robot block - object
  )

  (:predicates 
    (on ?block1 - block ?block2 - block)
    (ontable ?block - block)
    (clear ?block - block)
    (KBquery_fullHands ?robot - robot)
    (holding ?robot - robot ?block - block)
  )

  (:action pick-up
    :parameters (?robot - robot ?block - block)
    :precondition (and 
      (clear ?block) 
      (ontable ?block) 
      (not (KBquery_fullHands ?robot))
    )
    :effect
      (and 
        (not (ontable ?block))
        (not (clear ?block))
        (holding ?robot ?block)
      )
  )

  (:action put-down
    :parameters (?robot - robot ?block - block)
    :precondition (holding ?robot ?block)
    :effect
      (and 
        (not (holding ?robot ?block))
        (clear ?block)
        (ontable ?block)
      )
  )

  (:action stack
    :parameters (?robot - robot ?block1 - block ?block2 - block)
    :precondition (and 
      (holding ?robot ?block1) 
      (clear ?block2)
      )
    :effect
      (and 
        (not (holding ?robot ?block1))
        (not (clear ?block2))
        (clear ?block1)
        (on ?block1 ?block2)
      )
  )

  (:action unstack
    :parameters (?robot - robot ?block1 - block ?block2 - block)
    :precondition (and 
      (on ?block1 ?block2) 
      (clear ?block1) 
      (not (KBquery_fullHands ?robot))
    )
    :effect
      (and 
        (holding ?robot ?block1)
        (clear ?block2)
        (not (clear ?block1))
        (not (on ?block2 ?block1))
      )
  )
)

; problem
(define (problem BLOCKS-7-0)
(:domain BLOCKS)
(:objects B E A C D F G - block pr2 - robot)
(:INIT (CLEAR E) (ONTABLE D) (ON E G) (ON G B) (ON B A) (ON A F) (ON F C)
 (ON C D))
(:goal (AND (ON A G) (ON G D) (ON D B) (ON B C) (ON C F) (ON F E)))
)

; plan
1. (unstack pr2 e g)
   deleted: (clear e)
   added: (holding pr2 e) (clear g)
   goals met: 0 of 6
2. (unstack pr2 g b)
   deleted: (clear g)
   added: (holding pr2 g) (clear b)
   goals met: 0 of 6
3. (put-down pr2 e)
   deleted: (holding pr2 e)
   added: (clear e) (ontable e)
   goals met: 0 of 6
4. (unstack pr2 b a)
   deleted: (clear b)
   added: (holding pr2 b) (clear a)
   goals met: 0 of 6
5. (put-down pr2 g)
   deleted: (holding pr2 g)
   added: (clear g) (ontable g)
   goals met: 0 of 6
6. (unstack pr2 a f)
   deleted: (clear a)
   added: (holding pr2 a) (clear f)
   goals met: 0 of 6
7. (stack pr2 a g)
   deleted: (holding pr2 a) (clear g)
   added: (clear a) (on a g)
   goals met: 1 of 6
8. (unstack pr2 f c)
   deleted: (clear f)
   added: (holding pr2 f) (clear c)
   goals met: 1 of 6
9. (stack pr2 f e)
   deleted: (holding pr2 f) (clear e)
   added: (clear f) (on f e)
   goals met: 2 of 6
10. (unstack pr2 c d)
   deleted: (clear c)
   added: (holding pr2 c) (clear d)
   goals met: 2 of 6
11. (stack pr2 c f)
   deleted: (holding pr2 c) (clear f)
   added: (clear c) (on c f)
   goals met: 3 of 6
12. (pick-up pr2 d)
   deleted: (ontable d) (clear d)
   added: (holding pr2 d)
   goals met: 3 of 6
13. (stack pr2 b c)
   deleted: (holding pr2 b) (clear c)
   added: (clear b) (on b c)
   goals met: 4 of 6
14. (unstack pr2 a g)
   deleted: (clear a)
   added: (holding pr2 a) (clear g)
   goals met: 4 of 6
15. (stack pr2 d b)
   deleted: (holding pr2 d) (clear b)
   added: (clear d) (on d b)
   goals met: 5 of 6
16. (pick-up pr2 g)
   deleted: (ontable g) (clear g)
   added: (holding pr2 g)
   goals met: 5 of 6
17. (stack pr2 g d)
   deleted: (holding pr2 g) (clear d)
   added: (clear g) (on g d)
   goals met: 6 of 6
